Documents/КорректировкаБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>КорректировкаБюджета</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БюджетРасходы</xr:Item>
				<xr:Item>InformationRegister.СтруктураБюджетаРасходы</xr:Item>
				<xr:Item>AccumulationRegister.БюджетДоходы</xr:Item>
				<xr:Item>InformationRegister.СтруктураБюджетаДоходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Детализация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Утвержден</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокНаНачало</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокНаНачалоДоКорректировки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокНаНачалоКорректировка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бюджет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорректировкаБюджета</v8:Type>
						<v8:Type>cfg:DocumentRef.Бюджет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Доходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаПланирования</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДохода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДоКорректировки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКорректировки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоГруппа</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаПланирования</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаправлениеДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасхода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДоКорректировки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКорректировки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоГруппа</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РасходыПоНаправлениямДеятельности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаПланирования</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаправлениеДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДоКорректировки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКорректировки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтруктураДоходов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяДохода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Родитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоГруппа</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтруктураРасходов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаправлениеДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасхода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Родитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоГруппа</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/КорректировкаБюджета/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция возвращает время документа по умолчанию.
// Требуется если пользователь используется опцию:
// "Время документов устанавливать автоматически".
//
// Возвращаемое значение:
//    Структура - Структура с ключами "Часы" и "Минуты".
//
Функция ВремяДокументаПоУмолчанию() Экспорт
	
	Возврат Новый Структура("Часы, Минуты", 8, 0);
	
КонецФункции

// Возвращает последнюю корректировку бюджета. Последняя корректировка хранит актуальную структуру бюджета
//
// Параметры:
//    Бюджет - ДокументСсылка.Бюджет - Ссылка на бюджет
// Возвращаемое значение:
//     - ДокументСсылка.КорректировкаБюджета - последняя корректировка
//     - ДокументСсылка.Бюджет - ссылка на сам бюджет, если корректировок нет
//
Функция ПоследняяКорректировка(Бюджет) Экспорт
	
	КорректировкаБюджета = ДокументКорректировкиБюджета(Бюджет);
	Если КорректировкаБюджета.Пустая() Тогда
		Возврат Бюджет;
	КонецЕсли;
	
	Возврат ПоследняяКорректировка(КорректировкаБюджета);
	
КонецФункции

// Возвращает массив со всеми корректировками бюджета
//
// Параметры:
//    Ссылка - ДокументСсылка.Бюджет - Ссылка на бюджет
// Возвращаемое значение:
//     - Массив из ДокументСсылка.КорректировкаБюджета
//
Функция ВсеКорректировки(Знач Ссылка) Экспорт
	
	ВсеКорректировки = Новый Массив;
	ЕстьКорректировка = Истина;
	
	Пока ЕстьКорректировка Цикл
		Ссылка = ДокументКорректировкиБюджета(Ссылка);
		Если Не Ссылка.Пустая() Тогда
			ВсеКорректировки.Добавить(Ссылка);
		Иначе
			ЕстьКорректировка = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ВсеКорректировки;
	
КонецФункции

// Возвращает ссылку на исходный бюджет, по которому введена корректировка
//
// Параметры:
//    Ссылка - ДокументСсылка.КорректировкаБюджета - Ссылка на корректировку
// Возвращаемое значение:
//     - ДокументСсылка.Бюджет
//
Функция БюджетПоКорректировке(Знач Ссылка) Экспорт
	
	Ссылка = ДокументОснованиеКорректировки(Ссылка);
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.Бюджет") Тогда
		Возврат Ссылка;
	КонецЕсли;
	
	Возврат БюджетПоКорректировке(Ссылка);
	
КонецФункции

// Функция возвращает данные корректировки бюджета
//
// Параметры:
//    Ссылка - ДокументСсылка.КорректировкаБюджета - Ссылка на документ, которых хранит данные корректировки.
// Возвращаемое значение:
//    Структура - см. БюджетДоходовРасходов.НовыйДанныеКорректировки
//
Функция ДанныеКорректировки(Ссылка) Экспорт
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.Бюджет") Тогда
		// Вернем данные исходного бюджета,
		// дополненные колонками для сумм корректировки
		Возврат ДанныеБюджетаДляКорректировки(Ссылка);
	КонецЕсли;
	
	ДанныеКорректировки = БюджетДоходовРасходов.НовыйДанныеКорректировки();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КорректировкаБюджета.Организация КАК Организация,
	|	КорректировкаБюджета.Детализация КАК Детализация,
	|	КорректировкаБюджета.Бюджет КАК Бюджет,
	|	КорректировкаБюджета.Период КАК Период,
	|	КорректировкаБюджета.Утвержден КАК Утвержден,
	|	КорректировкаБюджета.ОстатокНаНачало КАК ОстатокНаНачало,
	|	КорректировкаБюджета.ОстатокНаНачалоДоКорректировки КАК ОстатокНаНачалоДоКорректировки,
	|	КорректировкаБюджета.ОстатокНаНачалоКорректировка КАК ОстатокНаНачалоКорректировка,
	|	КорректировкаБюджета.Комментарий КАК Комментарий
	|ИЗ
	|	Документ.КорректировкаБюджета КАК КорректировкаБюджета
	|ГДЕ
	|	КорректировкаБюджета.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КорректировкаБюджетаДоходы.ДатаПланирования КАК ДатаПланирования,
	|	КорректировкаБюджетаДоходы.СтатьяДохода КАК СтатьяДохода,
	|	КорректировкаБюджетаДоходы.ЭтоГруппа КАК ЭтоГруппа,
	|	КорректировкаБюджетаДоходы.Сумма КАК Сумма,
	|	КорректировкаБюджетаДоходы.СуммаДоКорректировки КАК СуммаДоКорректировки,
	|	КорректировкаБюджетаДоходы.СуммаКорректировки КАК СуммаКорректировки
	|ИЗ
	|	Документ.КорректировкаБюджета.Доходы КАК КорректировкаБюджетаДоходы
	|ГДЕ
	|	КорректировкаБюджетаДоходы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КорректировкаБюджетаРасходы.ДатаПланирования КАК ДатаПланирования,
	|	КорректировкаБюджетаРасходы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	КорректировкаБюджетаРасходы.СтатьяРасхода КАК СтатьяРасхода,
	|	КорректировкаБюджетаРасходы.ЭтоГруппа КАК ЭтоГруппа,
	|	КорректировкаБюджетаРасходы.Сумма КАК Сумма,
	|	КорректировкаБюджетаРасходы.СуммаДоКорректировки КАК СуммаДоКорректировки,
	|	КорректировкаБюджетаРасходы.СуммаКорректировки КАК СуммаКорректировки
	|ИЗ
	|	Документ.КорректировкаБюджета.Расходы КАК КорректировкаБюджетаРасходы
	|ГДЕ
	|	КорректировкаБюджетаРасходы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КорректировкаБюджетаРасходыПоНаправлениямДеятельности.ДатаПланирования КАК ДатаПланирования,
	|	КорректировкаБюджетаРасходыПоНаправлениямДеятельности.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	КорректировкаБюджетаРасходыПоНаправлениямДеятельности.Сумма КАК Сумма,
	|	КорректировкаБюджетаРасходыПоНаправлениямДеятельности.СуммаДоКорректировки КАК СуммаДоКорректировки,
	|	КорректировкаБюджетаРасходыПоНаправлениямДеятельности.СуммаКорректировки КАК СуммаКорректировки
	|ИЗ
	|	Документ.КорректировкаБюджета.РасходыПоНаправлениямДеятельности КАК КорректировкаБюджетаРасходыПоНаправлениямДеятельности
	|ГДЕ
	|	КорректировкаБюджетаРасходыПоНаправлениямДеятельности.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПланирования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КорректировкаБюджетаСтруктураДоходов.СтатьяДохода КАК СтатьяДохода,
	|	КорректировкаБюджетаСтруктураДоходов.Родитель КАК Родитель,
	|	КорректировкаБюджетаСтруктураДоходов.ЭтоГруппа КАК ЭтоГруппа
	|ИЗ
	|	Документ.КорректировкаБюджета.СтруктураДоходов КАК КорректировкаБюджетаСтруктураДоходов
	|ГДЕ
	|	КорректировкаБюджетаСтруктураДоходов.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	КорректировкаБюджетаСтруктураДоходов.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КорректировкаБюджетаСтруктураРасходов.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	КорректировкаБюджетаСтруктураРасходов.СтатьяРасхода КАК СтатьяРасхода,
	|	КорректировкаБюджетаСтруктураРасходов.Родитель КАК Родитель,
	|	КорректировкаБюджетаСтруктураРасходов.ЭтоГруппа КАК ЭтоГруппа
	|ИЗ
	|	Документ.КорректировкаБюджета.СтруктураРасходов КАК КорректировкаБюджетаСтруктураРасходов
	|ГДЕ
	|	КорректировкаБюджетаСтруктураРасходов.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	КорректировкаБюджетаСтруктураРасходов.НомерСтроки";
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаРеквизиты = РезультатыЗапроса[0].Выбрать();
	ВыборкаРеквизиты.Следующий();
	ЗаполнитьЗначенияСвойств(ДанныеКорректировки.Реквизиты.Добавить(), ВыборкаРеквизиты);
	
	ВыборкаДоходы = РезультатыЗапроса[1].Выбрать();
	Пока ВыборкаДоходы.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ДанныеКорректировки.Доходы.Добавить(), ВыборкаДоходы);
	КонецЦикла;
	
	ВыборкаРасходы = РезультатыЗапроса[2].Выбрать();
	Пока ВыборкаРасходы.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ДанныеКорректировки.Расходы.Добавить(), ВыборкаРасходы);
	КонецЦикла;
	
	ВыборкаРасходыПоНаправлениямДеятельности = РезультатыЗапроса[3].Выбрать();
	Пока ВыборкаРасходыПоНаправлениямДеятельности.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(
			ДанныеКорректировки.РасходыПоНаправлениямДеятельности.Добавить(), ВыборкаРасходыПоНаправлениямДеятельности);
	КонецЦикла;
		
	ВыборкаСтруктураДоходов = РезультатыЗапроса[4].Выбрать();
	Пока ВыборкаСтруктураДоходов.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ДанныеКорректировки.СтруктураДоходов.Добавить(), ВыборкаСтруктураДоходов);
	КонецЦикла;
	
	ВыборкаСтруктураРасходов = РезультатыЗапроса[5].Выбрать();
	Пока ВыборкаСтруктураРасходов.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ДанныеКорректировки.СтруктураРасходов.Добавить(), ВыборкаСтруктураРасходов);
	КонецЦикла;
	
	Возврат ДанныеКорректировки;
	
КонецФункции

// Функция возвращает табличный документ с корректировкой бюджета
//
// Параметры:
//    Параметры - Структура - Структура с обязательным параметром Ссылка на документ "КорректировкаБюджета"
// Возвращаемое значение:
//    ТабличныйДокумент - Печатная форма
//
Функция СформироватьПечатнуюФорму(Параметры) Экспорт
	
	ДанныеКорректировки = ДанныеКорректировки(Параметры.Ссылка);
	РеквизитыДокумента = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ДанныеКорректировки.Реквизиты[0]);
	РеквизитыДокумента.Вставить("ДокументПредставление", Строка(Параметры.Ссылка));
	
	РеквизитыБюджета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.Бюджет, "Детализация,Период");
	КолонкиДетализации = БюджетДоходовРасходов.НовыйКолонкиДетализации();
	БюджетДоходовРасходов.ЗаполнитьКолонкиДетализации(КолонкиДетализации, РеквизитыБюджета);
	
	ДополнитьБюджетОстатками(ДанныеКорректировки, РеквизитыДокумента);
	
	ТекущаяКорректировка = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("КорректировкаБюджета");
	
	ВывестиШапку(РеквизитыДокумента, КолонкиДетализации, ТекущаяКорректировка, Макет);
	
	ВывестиОстаткиНаНачало(ДанныеКорректировки.ОстаткиНачало, ТекущаяКорректировка, Макет, КолонкиДетализации);
	
	ВывестиДоходы(ДанныеКорректировки, КолонкиДетализации, ТекущаяКорректировка, Макет);
	
	ВывестиРасходы(ДанныеКорректировки, КолонкиДетализации, ТекущаяКорректировка, Макет);
	
	ВывестиОстаткиНаКонец(ДанныеКорректировки.ОстаткиКонец, ТекущаяКорректировка, Макет, КолонкиДетализации);
	
	ВывестиПодвал(РеквизитыДокумента, ТекущаяКорректировка, Макет);
	
	Возврат ТекущаяКорректировка;
	
КонецФункции

// Получает описание предопределенных наборов свойств.
//
// Параметры:
//  Наборы - ДеревоЗначений - с колонками:
//     * Имя           - Строка - Имя набора свойств. Формируется из полного имени объекта
//                       метаданных заменой символа "." на "_".
//                       Например, "Документ_КорректировкаБюджета".
//     * Идентификатор - УникальныйИдентификатор - Идентификатор ссылки предопределенного элемента.
//     * Используется  - Неопределено, Булево - Признак того, что набор свойств используется.
//                       Например, можно использовать для скрытия набора по функциональным опциям.
//                       Значение по умолчанию - Неопределено, соответствует значению Истина.
//     * ЭтоГруппа     - Булево - Истина, если набор свойств является группой.
//
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт
	
	Набор = Наборы.Строки.Добавить();
	Набор.Имя = "Документ_КорректировкаБюджета";
	Набор.ЭтоГруппа = Истина;
	Набор.Идентификатор = Новый УникальныйИдентификатор("08e94c2b-54ce-4498-8b3f-8f4cd0acaaa0");
	Набор.Используется  = ПолучитьФункциональнуюОпцию("ВестиУчетБюджета");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		// Корректировка редактируется через форму специальной обработки "КорректировкаБюджета"
		Если Параметры.Свойство("Ключ") Тогда
			Параметры.Вставить("ДокументСсылка", Параметры.Ключ);
		КонецЕсли;
		Если ДополнительнаяИнформация.Свойство("ПовторноеИспользование") Тогда
			ДополнительнаяИнформация.ПовторноеИспользование = Истина;
		КонецЕсли;
		ВыбраннаяФорма = "Обработка.КорректировкаБюджета.Форма";
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если Данные.Свойство("Номер") И Данные.Свойство("Дата") Тогда
		СтандартнаяОбработка = Ложь;
		Представление = СтрШаблон(НСтр("ru='Корректировка бюджета № %1 от %2'", ОбщегоНазначения.КодОсновногоЯзыка()),
			ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Данные.Номер, Истина),
			Формат(Данные.Дата, "ДФ=dd.MM.yyyy"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом


// СтандартныеПодсистемы.УправлениеПечатью

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеПечатью


// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область ПодготовкаПараметровПроведения

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт
	
	ПараметрыПроведения = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	НомераТаблиц = Новый Структура;
	
	Запрос.Текст = ТекстЗапросаРеквизитыДокумента(НомераТаблиц);
	Результат    = Запрос.ВыполнитьПакет();
	ТаблицаРеквизиты = Результат[НомераТаблиц["Реквизиты"]].Выгрузить();
	ПараметрыПроведения.Вставить("Реквизиты", ТаблицаРеквизиты);
	
	НомераТаблиц = Новый Структура;
	Запрос.Текст = ТекстЗапросаРасходы(НомераТаблиц) +
		ТекстЗапросаДоходы(НомераТаблиц) +
		ТекстЗапросаСтруктураДоходов(НомераТаблиц) +
		ТекстЗапросаСтруктураРасходов(НомераТаблиц);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Если Не ПустаяСтрока(Запрос.Текст) Тогда
		Для Каждого НомерТаблицы Из НомераТаблиц Цикл
			ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
		КонецЦикла;
	КонецЕсли;
	
	Возврат ПараметрыПроведения;
	
КонецФункции 

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПодготовкаПараметровПроведения

Функция ТекстЗапросаРеквизитыДокумента(НомераТаблиц)
	
	НомераТаблиц.Вставить("ВременнаяТаблицаРеквизиты", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("Реквизиты", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	КорректировкаБюджета.Ссылка КАК Регистратор,
	|	КорректировкаБюджета.Дата КАК Период,
	|	КорректировкаБюджета.Организация КАК Организация,
	|	КорректировкаБюджета.Детализация КАК Детализация
	|ПОМЕСТИТЬ Реквизиты
	|ИЗ
	|	Документ.КорректировкаБюджета КАК КорректировкаБюджета
	|ГДЕ
	|	КорректировкаБюджета.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реквизиты.Регистратор КАК Регистратор,
	|	Реквизиты.Период КАК Период,
	|	Реквизиты.Организация КАК Организация,
	|	Реквизиты.Детализация КАК Детализация
	|ИЗ
	|	Реквизиты КАК Реквизиты";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаРасходы(НомераТаблиц)
	
	НомераТаблиц.Вставить("Расходы", НомераТаблиц.Количество());
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	КорректировкаБюджетаРасходы.ДатаПланирования КАК Период,
	|	КорректировкаБюджетаРасходы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	КорректировкаБюджетаРасходы.СтатьяРасхода КАК СтатьяРасхода,
	|	КорректировкаБюджетаРасходы.СуммаКорректировки КАК Сумма,
	|	КорректировкаБюджетаРасходы.СуммаДоКорректировки КАК СуммаДоКорректировки,
	|	КорректировкаБюджетаРасходы.СуммаКорректировки КАК СуммаКорректировки
	|ИЗ
	|	Документ.КорректировкаБюджета.Расходы КАК КорректировкаБюджетаРасходы
	|ГДЕ
	|	КорректировкаБюджетаРасходы.Ссылка = &Ссылка
	|	И КорректировкаБюджетаРасходы.ДатаПланирования <> ДАТАВРЕМЯ(1, 1, 1)
	|	И НЕ КорректировкаБюджетаРасходы.ЭтоГруппа";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
КонецФункции

Функция ТекстЗапросаДоходы(НомераТаблиц)
	
	НомераТаблиц.Вставить("Доходы", НомераТаблиц.Количество());
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	КорректировкаБюджетаДоходы.ДатаПланирования КАК Период,
	|	КорректировкаБюджетаДоходы.СтатьяДохода КАК СтатьяДохода,
	|	КорректировкаБюджетаДоходы.ЭтоГруппа КАК ЭтоГруппа,
	|	КорректировкаБюджетаДоходы.СуммаКорректировки КАК Сумма,
	|	КорректировкаБюджетаДоходы.СуммаДоКорректировки КАК СуммаДоКорректировки,
	|	КорректировкаБюджетаДоходы.СуммаКорректировки КАК СуммаКорректировки
	|ИЗ
	|	Документ.КорректировкаБюджета.Доходы КАК КорректировкаБюджетаДоходы
	|ГДЕ
	|	КорректировкаБюджетаДоходы.Ссылка = &Ссылка
	|	И КорректировкаБюджетаДоходы.ДатаПланирования <> ДАТАВРЕМЯ(1, 1, 1)
	|	И НЕ КорректировкаБюджетаДоходы.ЭтоГруппа";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаСтруктураДоходов(НомераТаблиц)

	НомераТаблиц.Вставить("СтруктураДоходов", НомераТаблиц.Количество());
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КорректировкаБюджетаСтруктураДоходов.СтатьяДохода КАК СтатьяДохода,
	|	КорректировкаБюджетаСтруктураДоходов.Родитель КАК Родитель,
	|	КорректировкаБюджетаСтруктураДоходов.ЭтоГруппа КАК ЭтоГруппа
	|ИЗ
	|	Документ.КорректировкаБюджета.СтруктураДоходов КАК КорректировкаБюджетаСтруктураДоходов
	|ГДЕ
	|	КорректировкаБюджетаСтруктураДоходов.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаСтруктураРасходов(НомераТаблиц)

	НомераТаблиц.Вставить("СтруктураРасходов", НомераТаблиц.Количество());
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КорректировкаБюджетаСтруктураРасходов.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	КорректировкаБюджетаСтруктураРасходов.СтатьяРасхода КАК СтатьяРасхода,
	|	КорректировкаБюджетаСтруктураРасходов.Родитель КАК Родитель,
	|	КорректировкаБюджетаСтруктураРасходов.ЭтоГруппа КАК ЭтоГруппа
	|ИЗ
	|	Документ.КорректировкаБюджета.СтруктураРасходов КАК КорректировкаБюджетаСтруктураРасходов
	|ГДЕ
	|	КорректировкаБюджетаСтруктураРасходов.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

#КонецОбласти

#Область ТабличныйДокумент

Процедура ДополнитьБюджетОстатками(ДанныеБюджета, Реквизиты)

	// Суммы
	ТаблицаДоходов = ДанныеБюджета.Доходы.Скопировать(Новый Структура("ЭтоГруппа", Ложь));
	ТаблицаДоходов.Свернуть("ДатаПланирования", "Сумма,СуммаДоКорректировки,СуммаКорректировки");
	ТаблицаРасходов = ДанныеБюджета.РасходыПоНаправлениямДеятельности.Скопировать();
	ТаблицаРасходов.Свернуть("ДатаПланирования", "Сумма,СуммаДоКорректировки,СуммаКорректировки");
	
	ТаблицаОстатков = ТаблицаДоходов.Скопировать();
	Для Каждого Строка Из ТаблицаРасходов Цикл
		НоваяСтрока = ТаблицаОстатков.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка, , "Сумма");
		НоваяСтрока.Сумма = -Строка.Сумма;
		НоваяСтрока.СуммаДоКорректировки = -Строка.СуммаДоКорректировки;
		НоваяСтрока.СуммаКорректировки = -Строка.СуммаКорректировки;
	КонецЦикла;
	ТаблицаОстатков.Свернуть("ДатаПланирования", "Сумма,СуммаДоКорректировки,СуммаКорректировки");
	ТаблицаОстатков.Сортировать("ДатаПланирования Возр");
	
	ТаблицаОстатковНачало = ТаблицаОстатков.СкопироватьКолонки();
	ТаблицаОстатковКонец = ТаблицаОстатков.СкопироватьКолонки();
	
	НакопленныйОстаток = Реквизиты.ОстатокНаНачало;
	НакопленныйОстатокДоКорректировки = Реквизиты.ОстатокНаНачалоДоКорректировки;
	НакопленныйОстатокКорректировка = Реквизиты.ОстатокНаНачалоКорректировка;
	
	Для Каждого Строка Из ТаблицаОстатков Цикл
		Если Не ЗначениеЗаполнено(Строка.ДатаПланирования) Тогда
			СтрокаНачало = ТаблицаОстатковНачало.Добавить();
			СтрокаНачало.Сумма = Реквизиты.ОстатокНаНачало;
			СтрокаНачало.СуммаДоКорректировки = Реквизиты.ОстатокНаНачалоДоКорректировки;
			СтрокаНачало.СуммаКорректировки = Реквизиты.ОстатокНаНачалоКорректировка;
			
			СтрокаКонец = ТаблицаОстатковКонец.Добавить();
			СтрокаКонец.Сумма = Реквизиты.ОстатокНаНачало + Строка.Сумма;
			СтрокаКонец.СуммаДоКорректировки = Реквизиты.ОстатокНаНачалоДоКорректировки + Строка.СуммаДоКорректировки;
			СтрокаКонец.СуммаКорректировки = Реквизиты.ОстатокНаНачалоКорректировка + Строка.СуммаКорректировки;
			
		Иначе
			СтрокаНачало = ТаблицаОстатковНачало.Добавить();
			СтрокаНачало.ДатаПланирования = Строка.ДатаПланирования;
			СтрокаНачало.Сумма = НакопленныйОстаток;
			СтрокаНачало.СуммаДоКорректировки = НакопленныйОстатокДоКорректировки;
			СтрокаНачало.СуммаКорректировки = НакопленныйОстатокКорректировка;
			
			СтрокаКонец = ТаблицаОстатковКонец.Добавить();
			СтрокаКонец.ДатаПланирования = Строка.ДатаПланирования;
			НакопленныйОстаток = НакопленныйОстаток + Строка.Сумма;
			НакопленныйОстатокДоКорректировки = НакопленныйОстатокДоКорректировки + Строка.СуммаДоКорректировки;
			НакопленныйОстатокКорректировка = НакопленныйОстатокКорректировка + Строка.СуммаКорректировки;
			СтрокаКонец.Сумма = НакопленныйОстаток;
			СтрокаКонец.СуммаДоКорректировки = НакопленныйОстатокДоКорректировки;
			СтрокаКонец.СуммаКорректировки = НакопленныйОстатокКорректировка;
		КонецЕсли;
	КонецЦикла;
	
	ДанныеБюджета.Вставить("ОстаткиНачало", ТаблицаОстатковНачало);
	ДанныеБюджета.Вставить("ОстаткиКонец",  ТаблицаОстатковКонец);
	
КонецПроцедуры

Процедура ВывестиШапку(РеквизитыДокумента, КолонкиДетализации, ТабличныйДокумент, Макет)
	
	// Шапка
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Шапка.Параметры.Заполнить(РеквизитыДокумента);
	ТабличныйДокумент.Вывести(Шапка);
	
	// Шапка таблицы
	ШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы|ОсновнаяЧасть");
	ТабличныйДокумент.Вывести(ШапкаТаблицы);
	ШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы|Итого");
	ТабличныйДокумент.Присоединить(ШапкаТаблицы);
	
	СтруктураПараметров = Новый Структура;
	Если РеквизитыДокумента.Детализация = Перечисления.Периодичность.Квартал Тогда
		НадписьДетализация = НСтр("ru='кварталам'");
	Иначе
		НадписьДетализация = НСтр("ru='месяцам'");
	КонецЕсли;
	СтруктураПараметров.Вставить("НадписьДетализация", НадписьДетализация);
	
	НомерЯчейкиНачало = ТабличныйДокумент.ШиринаТаблицы;
	Для Каждого Колонка Из КолонкиДетализации Цикл
		СтруктураПараметров.Вставить("ДетализацияПериода", Колонка.Заголовок);
		ШапкаТаблицаПериод = Макет.ПолучитьОбласть("ШапкаТаблицы|Детализация");
		ШапкаТаблицаПериод.Параметры.Заполнить(СтруктураПараметров);
		ТабличныйДокумент.Присоединить(ШапкаТаблицаПериод);
	КонецЦикла;
	НомерЯчейкиКонец = ТабличныйДокумент.ШиринаТаблицы;
	НомерСтроки = ТабличныйДокумент.ВысотаТаблицы - 2; // Объединяем только верхнюю строку, где написано "В том числе по"
	ТабличныйДокумент.Область(НомерСтроки, НомерЯчейкиНачало - 2, НомерСтроки, НомерЯчейкиКонец).Объединить();
	
КонецПроцедуры

Процедура ВывестиДоходы(ДанныеБюджета, КолонкиДетализации, ТабличныйДокумент, Макет)
	
	ЕстьКорректировкиПоДоходам = Ложь;
	Для Каждого СтрокаДоходы Из ДанныеБюджета.Доходы Цикл
		Если СтрокаДоходы.СуммаКорректировки <> 0 Тогда
			ЕстьКорректировкиПоДоходам = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЕстьКорректировкиПоДоходам Тогда
		Возврат;
	КонецЕсли;
	
	// Раздел "Доходы"
	Раздел = НСтр("ru='Финансирование'");
	ВывестиРаздел(Раздел, КолонкиДетализации, ТабличныйДокумент, Макет);
	
	// Строки таблицы
	СтруктураПоиска = Новый Структура("Родитель", Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка());
	ТаблицаСтруктурыДоходов = ДанныеБюджета.СтруктураДоходов.Скопировать(СтруктураПоиска);
	ТаблицаИтоговПоДоходам = ДанныеБюджета.Доходы.СкопироватьКолонки();
	ДанныеБюджета.Вставить("ИтогиПоДоходам", ТаблицаИтоговПоДоходам);
	ВывестиДоходыСИерархией(ТаблицаСтруктурыДоходов, "", ДанныеБюджета, КолонкиДетализации, ТабличныйДокумент, Макет, 0);
	
	// Итоги по разделу
	ОбластьИтогоПоРазделу = Макет.ПолучитьОбласть("ИтогоПоРазделу|ОсновнаяЧасть");
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("НадписьИтогоПоРазделу", НСтр("ru='Итого финансирования:'"));
	ОбластьИтогоПоРазделу.Параметры.Заполнить(СтруктураПараметров);
	ТабличныйДокумент.Вывести(ОбластьИтогоПоРазделу);
	
	ТаблицаДоходов = ДанныеБюджета.ИтогиПоДоходам;
	ТаблицаДоходов.Свернуть("ДатаПланирования", "Сумма,СуммаДоКорректировки,СуммаКорректировки");
	ВывестиСуммы(ТаблицаДоходов, "ИтогоПоРазделу", Макет, ТабличныйДокумент, КолонкиДетализации);
	
КонецПроцедуры

Процедура ВывестиДоходыСИерархией(ТаблицаСтруктураДоходов, НомерПоПорядку, ДанныеБюджета, КолонкиДетализации, ТабличныйДокумент, Макет, Уровень)
	
	ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаДохода|ОсновнаяЧасть");
	НовыйНомерПоПорядку = 1;
	Для Каждого СтрокаДоходы Из ТаблицаСтруктураДоходов Цикл
		
		ТаблицаДоходовПоСтатье = ДанныеБюджета.Доходы.Скопировать(Новый Структура("СтатьяДохода", СтрокаДоходы.СтатьяДохода));
		ТаблицаДоходовПоСтатье.Сортировать("ДатаПланирования Возр");
		СтрокаИтого = ТаблицаДоходовПоСтатье[0];
		Если Не ЗначениеЗаполнено(СтрокаИтого.СуммаКорректировки) Тогда
			// Нет корректировок
			Продолжить;
		КонецЕсли;
	
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("НомерСтроки",  СтрШаблон("%1%2", НомерПоПорядку, НовыйНомерПоПорядку));
		СтруктураПараметров.Вставить("СтатьяДохода", СтрокаДоходы.СтатьяДохода);
		ОбластьСтрока.Параметры.Заполнить(СтруктураПараметров);
		ОбластьСтрока.Области.СтатьяДохода.Отступ = Уровень * 2;
		ТабличныйДокумент.Вывести(ОбластьСтрока);
		
		ВывестиСуммы(ТаблицаДоходовПоСтатье, "СтрокаДохода", Макет, ТабличныйДокумент, КолонкиДетализации);
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаДоходовПоСтатье, ДанныеБюджета.ИтогиПоДоходам);
		
		Если СтрокаДоходы.ЭтоГруппа Тогда
			НомерПоПорядкуДляСледующейГруппы = СтрШаблон("%1%2.", НомерПоПорядку, НовыйНомерПоПорядку);
			НоваяТаблицаСтруктурыДоходов = ДанныеБюджета.СтруктураДоходов.Скопировать(
				Новый Структура("Родитель", СтрокаДоходы.СтатьяДохода));
			НовыйУровень = Уровень + 1;
			ВывестиДоходыСИерархией(
				НоваяТаблицаСтруктурыДоходов,
				НомерПоПорядкуДляСледующейГруппы,
				ДанныеБюджета,
				КолонкиДетализации,
				ТабличныйДокумент,
				Макет,
				НовыйУровень);
		КонецЕсли;
		НовыйНомерПоПорядку = НовыйНомерПоПорядку + 1;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВывестиРаздел(ИмяРаздела, КолонкиДетализации, ТабличныйДокумент, Макет)

	Раздел = Макет.ПолучитьОбласть("Раздел|ОсновнаяЧасть");
	Раздел.Параметры.Заполнить(Новый Структура("Раздел", ИмяРаздела));
	ТабличныйДокумент.Вывести(Раздел);
	РазделИтого = Макет.ПолучитьОбласть("Раздел|Итого");
	ТабличныйДокумент.Присоединить(РазделИтого);
	
	НомерЯчейкиНачало = РазделИтого.ШиринаТаблицы + Раздел.ШиринаТаблицы + 1;
	Счетчик = 1;
	Пока Счетчик < КолонкиДетализации.Количество() Цикл
		РазделПериод = Макет.ПолучитьОбласть("Раздел|Детализация");
		ТабличныйДокумент.Присоединить(РазделПериод);
		Счетчик = Счетчик + 1;
	КонецЦикла;
	НомерЯчейкиКонец = ТабличныйДокумент.ШиринаТаблицы;
	НомерСтроки = ТабличныйДокумент.ВысотаТаблицы;
	ОбластьОбъединения = ТабличныйДокумент.Область(НомерСтроки, НомерЯчейкиНачало, НомерСтроки, НомерЯчейкиКонец);
	ОбластьОбъединения.Объединить();
	ОбластьОбъединения.ГраницаСправа = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
	
КонецПроцедуры

Процедура ВывестиОстаткиНаНачало(Остатки, ТабличныйДокумент, Макет, КолонкиДетализации)
	
	Остатки.Сортировать("ДатаПланирования Возр");
	СтрокаИтого = Остатки[0];
	Если Не ЗначениеЗаполнено(СтрокаИтого.СуммаКорректировки) Тогда
		// Нет корректировок
		Возврат;
	КонецЕсли;
	
	// Остатки
	ОбластьИтогоПоРазделу = Макет.ПолучитьОбласть("ИтогоПоРазделу|ОсновнаяЧасть");
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("НадписьИтогоПоРазделу", НСтр("ru='Остаток на начало:'"));
	ОбластьИтогоПоРазделу.Параметры.Заполнить(СтруктураПараметров);
	ТабличныйДокумент.Вывести(ОбластьИтогоПоРазделу);
	
	// Суммы
	ВывестиСуммы(Остатки, "ИтогоПоРазделу", Макет, ТабличныйДокумент, КолонкиДетализации);
	
КонецПроцедуры

Процедура ВывестиОстаткиНаКонец(Остатки, ТабличныйДокумент, Макет, КолонкиДетализации)
	
	Остатки.Сортировать("ДатаПланирования Возр");
	СтрокаИтого = Остатки[0];
	Если Не ЗначениеЗаполнено(СтрокаИтого.СуммаКорректировки) Тогда
		// Нет корректировок
		Возврат;
	КонецЕсли;
	
	// Остатки
	ОбластьИтогоПоРазделу = Макет.ПолучитьОбласть("ИтогоПоРазделу|ОсновнаяЧасть");
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("НадписьИтогоПоРазделу", НСтр("ru='Остаток на конец:'"));
	ОбластьИтогоПоРазделу.Параметры.Заполнить(СтруктураПараметров);
	ТабличныйДокумент.Вывести(ОбластьИтогоПоРазделу);
	
	ВывестиСуммы(Остатки, "ИтогоПоРазделу", Макет, ТабличныйДокумент, КолонкиДетализации);
	
КонецПроцедуры

Процедура ВывестиРасходы(ДанныеБюджета, КолонкиДетализации, ТабличныйДокумент, Макет)
	
	ЕстьКорректировкиПоРасходам = Ложь;
	Для Каждого СтрокаРасходы Из ДанныеБюджета.Расходы Цикл
		Если СтрокаРасходы.СуммаКорректировки <> 0 Тогда
			ЕстьКорректировкиПоРасходам = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЕстьКорректировкиПоРасходам Тогда
		Возврат;
	КонецЕсли;
	
	// Раздел "Расходы"
	Раздел = НСтр("ru='Расходы'");
	ВывестиРаздел(Раздел, КолонкиДетализации, ТабличныйДокумент, Макет);
	
	// Строки таблицы
	ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаНаправлениеДеятельности|ОсновнаяЧасть");
	НомерПоПорядку = 1;
	
	ТаблицаРасходыПоНаправлениямДеятельности = ДанныеБюджета.СтруктураРасходов.Скопировать();
	ТаблицаРасходыПоНаправлениямДеятельности.Свернуть("НаправлениеДеятельности");
	ТаблицаИтоговПоРасходам = ДанныеБюджета.РасходыПоНаправлениямДеятельности.СкопироватьКолонки();
	Для Каждого НаправлениеДеятельности Из ТаблицаРасходыПоНаправлениямДеятельности.ВыгрузитьКолонку("НаправлениеДеятельности") Цикл
		
		Отбор = Новый Структура("НаправлениеДеятельности", НаправлениеДеятельности);
		ТаблицаРасходовПоНаправлениямДеятельности = ДанныеБюджета.РасходыПоНаправлениямДеятельности.Скопировать(Отбор);
		ТаблицаРасходовПоНаправлениямДеятельности.Сортировать("ДатаПланирования Возр");
		СтрокаИтого = ТаблицаРасходовПоНаправлениямДеятельности[0];
		Если Не ЗначениеЗаполнено(СтрокаИтого.СуммаКорректировки) Тогда
			// По данному направлению деятельности нет корректровок
			Продолжить;
		КонецЕсли;
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("НомерСтроки",   НомерПоПорядку);
		СтруктураПараметров.Вставить("НаправлениеДеятельности", НаправлениеДеятельности);
		ОбластьСтрока.Параметры.Заполнить(СтруктураПараметров);
		ТабличныйДокумент.Вывести(ОбластьСтрока);
		
		ВывестиСуммы(ТаблицаРасходовПоНаправлениямДеятельности, "СтрокаНаправлениеДеятельности", Макет, ТабличныйДокумент, КолонкиДетализации);
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаРасходовПоНаправлениямДеятельности, ТаблицаИтоговПоРасходам);
		
		// Выводим подчиненные статьи расходов
		Отбор = Новый Структура(
			"НаправлениеДеятельности, Родитель",
			НаправлениеДеятельности, Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка());
		Уровень = 1;
		НомерПоПорядкуДляСтатьи = СтрШаблон("%1.", НомерПоПорядку);
		ВывестиСтрокиРасходовПоНаправлениюДеятельности(
			ДанныеБюджета,
			Отбор,
			НомерПоПорядкуДляСтатьи,
			Макет,
			ТабличныйДокумент,
			Уровень,
			КолонкиДетализации);
		
		НомерПоПорядку = НомерПоПорядку + 1;
		
	КонецЦикла;
	
	ТаблицаИтоговПоРасходам.Свернуть("ДатаПланирования", "Сумма,СуммаДоКорректировки,СуммаКорректировки");
	ТаблицаИтоговПоРасходам.Сортировать("ДатаПланирования Возр");
	
	ОбластьИтогоПоРазделу = Макет.ПолучитьОбласть("ИтогоПоРазделу|ОсновнаяЧасть");
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("НадписьИтогоПоРазделу", НСтр("ru='Итого расходов:'"));
	ОбластьИтогоПоРазделу.Параметры.Заполнить(СтруктураПараметров);
	ТабличныйДокумент.Вывести(ОбластьИтогоПоРазделу);
	
	ВывестиСуммы(ТаблицаИтоговПоРасходам, "ИтогоПоРазделу", Макет, ТабличныйДокумент, КолонкиДетализации);
	
КонецПроцедуры

Процедура ВывестиСтрокиРасходовПоНаправлениюДеятельности(ДанныеБюджета, Отбор, НомерПоПорядкуДляСтатьи, Макет, ТабличныйДокумент, Уровень, КолонкиДетализации)

	ТаблицаСтруктураРасходов = ДанныеБюджета.СтруктураРасходов.Скопировать(Отбор);
	ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаРасхода|ОсновнаяЧасть");
		
	НомерПоПорядку = 1;
	Для Каждого СтрокаРасходов Из ТаблицаСтруктураРасходов Цикл
		
		СтатьяРасхода = СтрокаРасходов.СтатьяРасхода;
		Если Не ЗначениеЗаполнено(СтатьяРасхода) Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("НомерСтроки",   СтрШаблон("%1%2", НомерПоПорядкуДляСтатьи, НомерПоПорядку));
		СтруктураПараметров.Вставить("СтатьяРасхода", СтатьяРасхода);
		ОбластьСтрока.Параметры.Заполнить(СтруктураПараметров);
		ОбластьСтрока.Области.СтатьяРасхода.Отступ = Уровень * 2;
		ТабличныйДокумент.Вывести(ОбластьСтрока);
		
		ТаблицаПоСтатьям = ДанныеБюджета.Расходы.Скопировать(
			Новый Структура("НаправлениеДеятельности, СтатьяРасхода", 
			Отбор.НаправлениеДеятельности, СтатьяРасхода));
		ВывестиСуммы(ТаблицаПоСтатьям, "СтрокаРасхода", Макет, ТабличныйДокумент, КолонкиДетализации);
		
		Если СтрокаРасходов.ЭтоГруппа Тогда
			НовыйОтбор = ОбщегоНазначения.СкопироватьРекурсивно(Отбор);
			НовыйОтбор.Родитель = СтатьяРасхода;
			НовыйНомерПоПорядкуДляСтатьи = СтрШаблон("%1%2.", НомерПоПорядкуДляСтатьи, НомерПоПорядку);
			НовыйУровень = Уровень + 1;
			ВывестиСтрокиРасходовПоНаправлениюДеятельности(
				ДанныеБюджета,
				НовыйОтбор,
				НовыйНомерПоПорядкуДляСтатьи,
				Макет,
				ТабличныйДокумент,
				НовыйУровень,
				КолонкиДетализации);
		КонецЕсли;
		
		НомерПоПорядку = НомерПоПорядку + 1;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВывестиСуммы(Таблица, ИмяОбласти, Макет, ТабличныйДокумент, КолонкиДетализации)
	
	Если Таблица.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Таблица.Сортировать("ДатаПланирования Возр");
	
	// У итого нет даты планирования
	СтрокаИтого = Таблица[0];
	
	ОбластьСтрокаИтого = Макет.ПолучитьОбласть(СтрШаблон("%1|Итого", ИмяОбласти));
	ОбластьСтрокаИтого.Параметры.Заполнить(СтрокаИтого);
	ТабличныйДокумент.Присоединить(ОбластьСтрокаИтого);
	
	Для Каждого КолонкаДетализации Из КолонкиДетализации Цикл
		ОбластьСтрокаДетализация = Макет.ПолучитьОбласть(СтрШаблон("%1|Детализация", ИмяОбласти));
		СтрокаТаблицы = Таблица.Найти(КолонкаДетализации.Дата, "ДатаПланирования");
		Если СтрокаТаблицы <> Неопределено Тогда
			ОбластьСтрокаДетализация.Параметры.Заполнить(СтрокаТаблицы);
		КонецЕсли;
		ТабличныйДокумент.Присоединить(ОбластьСтрокаДетализация);
	КонецЦикла;
	
КонецПроцедуры

Процедура ВывестиПодвал(РеквизитыДокумента, ТабличныйДокумент, Макет)
	
	ОтветственныеЛицаОрганизации = ОтветственныеЛицаБП.ОтветственныеЛица(
		РеквизитыДокумента.Организация, РеквизитыДокумента.Период);
	
	Подвал = Макет.ПолучитьОбласть("Подвал");
	Подвал.Параметры.Заполнить(ОтветственныеЛицаОрганизации);
	ТабличныйДокумент.Вывести(Подвал);
	
КонецПроцедуры

#КонецОбласти

Функция ДокументКорректировкиБюджета(Бюджет)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Бюджет", Бюджет);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КорректировкаБюджета.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.КорректировкаБюджета КАК КорректировкаБюджета
	|ГДЕ
	|	КорректировкаБюджета.Бюджет = &Бюджет
	|	И НЕ КорректировкаБюджета.ПометкаУдаления";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Документы.КорректировкаБюджета.ПустаяСсылка();
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	КонецЕсли;

КонецФункции

Функция ДокументОснованиеКорректировки(Ссылка)
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.Бюджет") Тогда
		Возврат Ссылка;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КорректировкаБюджета", Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КорректировкаБюджета.Бюджет КАК Бюджет
	|ИЗ
	|	Документ.КорректировкаБюджета КАК КорректировкаБюджета
	|ГДЕ
	|	КорректировкаБюджета.Ссылка = &КорректировкаБюджета";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Бюджет;
	
КонецФункции

Функция ДанныеБюджетаДляКорректировки(Бюджет)
	
	ДанныеКорректировки = БюджетДоходовРасходов.НовыйДанныеКорректировки();
	
	ДанныеБюджета = Документы.Бюджет.ДанныеБюджета(Бюджет);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДанныеБюджета.Реквизиты, ДанныеКорректировки.Реквизиты);
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДанныеБюджета.Доходы, ДанныеКорректировки.Доходы);
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДанныеБюджета.Расходы, ДанныеКорректировки.Расходы);
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДанныеБюджета.РасходыПоНаправлениямДеятельности, ДанныеКорректировки.РасходыПоНаправлениямДеятельности);
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДанныеБюджета.СтруктураДоходов, ДанныеКорректировки.СтруктураДоходов);
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ДанныеБюджета.СтруктураРасходов, ДанныеКорректировки.СтруктураРасходов);
	
	Реквизиты = ДанныеКорректировки.Реквизиты[0];
	Реквизиты.ОстатокНаНачалоДоКорректировки = ДанныеКорректировки.Реквизиты[0].ОстатокНаНачало;
	Реквизиты.Бюджет = Бюджет;
	Реквизиты.Утвержден = Ложь;
	
	ЗаполнитьСуммыКорректировокПоУмолчанию(ДанныеКорректировки.Доходы);
	ЗаполнитьСуммыКорректировокПоУмолчанию(ДанныеКорректировки.Расходы);
	ЗаполнитьСуммыКорректировокПоУмолчанию(ДанныеКорректировки.РасходыПоНаправлениямДеятельности);
	
	Возврат ДанныеКорректировки;
	
КонецФункции

Процедура ЗаполнитьСуммыКорректировокПоУмолчанию(ТаблицаДокумента)
	
	Для Каждого СтрокаТаблицы Из ТаблицаДокумента Цикл
		СтрокаТаблицы.СуммаДоКорректировки = СтрокаТаблицы.Сумма;
		СтрокаТаблицы.СуммаКорректировки = 0;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьКорректировкуИзЗагрузки(ДокументСоздания, ДокументСсылка) Экспорт
	
	ДокументСоздания.Заполнить(ДокументСсылка);
	ДокументСоздания.Дата = ТекущаяДатаСеанса();
	ДокументСоздания.Период = ТекущаяДатаСеанса();
	ДокументСоздания.Бюджет = ДокументСсылка; 
	ДокументСоздания.Детализация = ДокументСсылка.Детализация;
	ДокументСоздания.Организация = ДокументСсылка.Организация;
	
КонецПроцедуры
#КонецОбласти

#КонецЕсли
